import React, { Component } from 'react'
import { Switch, Route, NavLink as LinkNav } from 'react-router-dom'
import About from '../About'
import BlogList from '../BlogList'
import Header from '../../components/Header'
import Footer from '../../components/Footer'
import Author from '../../components/Author'
import Label from '../../components/Label'
import Contact from '../../components/Contact'
import { Row, Col, Menu } from 'antd'
import Statistics from '../../components/Statistics'
import { CrownTwoTone, WalletTwoTone, IdcardTwoTone } from '@ant-design/icons';
import './index.css'

const { Item } = Menu;

export default class index extends Component {
    render() {
        return (
            <>
                <Row justify='center'>
                    <Col span={19}>
                        <h2>博客标题</h2>
                        <Statistics isCenter={true} />
                        <div className='blogStyle'>
                            博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情博客详情
                        </div>
                    </Col>
                    <Col span={5}>
                        <Author />
                        <Label />
                        <Contact />
                    </Col>
                </Row>
                <Footer />
            </>
        )
    }
}
